# Конфигурация подключенных устройств. Авторежимы настраиваются через бота.
# Очередность определяет порядок вывода информации и порядок кнопок управления.
class devices:

    config = {
        "locations": {
            "home": {
                "name": "Дом",
                "access": {"view": "user"}, 
                "list": {
                    "flow1": {
                        "name": "Этаж-1",
                        "access": {"view": "user"}, 
                    },
                    "flow2": {
                        "name": "Этаж-2",
                        "access": {"view": "user"}, 
                    },   
                }   
            },
            "ogorod": {
                "name": "Огород",
                "access": {"view": "user"}, 
                "list": {
                    "parnik1": {
                        "name": "Парник-1",
                        "access": {"view": "user"}, 
                    },
                    "parnik2": {
                        "name": "Парник-2",
                        "access": {"view": "admin"}, 
                    },   
                }   
            }
        },
        "devices": {
            "termobot1": {
                # Название - отображается в инфо и сообщениях
                "name": "1 этаж",
                # Модель (класс), обслуживающая устройство (находится в папке models)
                "model": "Termobot",
                # Видеопоток
                "videocam": False,
                # Отправлять информацию по устройству в рассылке
                "send": True,
                # Поддержка авторежима (возможность настройки/активации) - только для sw
                "auto_mode": False,
                # URL устройства для доступа по http/https
                "url": "http://192.168.7.110",
                # Включить логирование по часам за последние 3 месяца
                "save_log": True,
                # Права на просмотр / управление / редактировани. Если не задано, то указанных прав нет.
                "access": {"view": "user"},
                # Размещение разделитель дефис "-"
                "location": "home-flow1",
                # Отображаемые на графике параметры устройства
                "vals": {"temperature"},
                # Отображаемые на графике параметры смежных устройств
                "link": {"tasmota1.state"},
                # Минимальный набор отображаемых значений для отчета
                "info_mini_list": ["state"],
                # Поддерживаемые команды
                "commands": {
                    "refresh": {
                        "line": 1, # строка кнопки
                        "name": "Обновить", # название
                        "command": "refresh" # метод в контроллере
                    },
                    "up": {
                        "line": 1,
                        "name": "Вверх",
                        "command": "gouri",
                        "command_params": {"uri": "/cgi-bin/camctrl.cgi?move=up"}, # 
                        "sleep": 1 # Задержка после выполнения перед обновлением инфо о устройстве
                    },
                    "on": {
                        "line": 1,
                        "name": "Вкл",
                        "command": "set",
                        "command_params": {"state": "ON"}, # 
                        "sleep": 1 # Задержка после выполнения перед обновлением инфо о устройстве
                    },
                },
                # Настройка авторежима
                "auto": [
                    {
                        "command": {"state":"ON"}, # Выполняемая команда set(...)
                        "conditions": {
                            "exp_if": "(src1<5) and (exp<-10)", # Можно задать логическую формулу с параметрами из source, которая должна дать True 
                            "week": [1,2,3,4,5,6,7],
                            "time": [["12:00","12:40"], ["14:00","14:40"], ["16:00","16:40"]]
                        },
                        "source": {
                            "src1": "termobot1.temperature",
                            "src2": "termobot2.temperature",
                        }
                    },
                    {   
                        "set": {"state":"VALUE"}, # Если в conditions есть value, то "VALUE" будет заменено на его значение.
                        "conditions": {
                            "exp_if": "(src1<5) and (exp<-10)", # Можно задать логическую формулу с параметрами из source, которая должна дать True 
                            "value": "(src1+src2)/10", # можно задать формулу с параметрами из source, будет установлен target 
                            "week": [1,2,3,4,5,6,7],
                            "time": [["12:00","12:40"], ["14:00","14:40"], ["16:00","16:40"]]
                        },
                        "source": {
                            "src1": "termobot1.temperature",
                            "src2": "termobot2.temperature",
                        } 
                    }
                ]
            }
        }
    }    